/*************************************************************************
	> File Name: euler25.c
	> Author: 
	> Mail: 
	> Created Time: 2018年07月27日 星期五 09时58分52秒
 ************************************************************************/

//一千位斐波那契数

#include <stdio.h>

int fib[3][1005] = {{0, 0}, {1, 1}, {1, 1}};   //3:大整数的个数，1005每个大整数存储的长度。
int n = 2;    //代表fib数的项数

int main() {

    while(fib[n % 3][0] < 1000) {

        n += 1; 
        //int *a = fib[n % 3], *b = fib[(n - 1) % 3], *c = fib[(n - 2) % 3];
        fib[n % 3][0] = fib[(n - 1) % 3][0];    //新生成的fib对项数的长度

        for(int i = 1; i <= fib[(n - 1) % 3][0]; i++) {

            fib[n % 3][i] = fib[(n - 1) % 3][i] + fib[(n - 2) % 3][i];
        }

        for(int i = 1; i <= fib[n % 3][0]; i++) {  //大整数加法处理进位
            
            if(fib[n % 3][i] < 10)  continue;
            fib[n % 3][i + 1] += fib[n % 3][i] / 10;
            fib[n % 3][i] %= 10;
            fib[n % 3][0] +=(fib[n % 3][0] == i);

        }
    }

    printf("%d\n",n);

    return 0;
}
