/*************************************************************************
	> File Name: euler20.c
	> Author: 
	> Mail: 
	> Created Time: 2018年07月30日 星期一 12时08分41秒
 ************************************************************************/

//阶乘数字和

#include <stdio.h>

int main() {
    int ans[400] = {1, 1};

    for(int i = 1; i <= 100; i++) {
        
        for(int j = 1; j <= ans[0]; j++) {

            ans[j] *= i;        //从1依次乘到100并将各个乘积存放到数组中; 
        }

        for(int j = 1; j <= ans[0]; j++) {
            if(ans[j] < 10) continue;    //若当前数字的值小于10，则判断下一个数;
            ans[j + 1] += ans[j] / 10;  //大于10时向前一位进位并保留当前数字的个位;
            ans[j] %= 10;
            ans[0] += (j == ans[0]);  //最后一位数字进位总长度加一;
        }
    }

    int num = 0;

    for(int i = 1; i <= ans[0]; i++) {
        
        num += ans[i];     //将数组中的数字依次相加得到最终结果;
    }

    printf("%d\n", num);

    return 0;
}

