/*************************************************************************
	> File Name: luogu_P1422.c
	> Author: xinyue
	> Mail: shinyeal9@yeah.net
	> Created Time: 2018年08月18日 星期六 10时44分08秒
 ************************************************************************/

//小玉家的电费

#include <stdio.h>

int main() {

    int x;
    float ans = 0;
    scanf("%d", &x);
    if(x <= 150) {
        ans = x * 0.4463;
    } else if (x <= 400) {
        ans = 150 * 0.4463 + (x - 150) * 0.4663;
    } else {
        ans = 150 * 0.4463 + (400 - 150) * 0.4663 + (x - 400) * 0.5663;
    }

    printf("%.1f", ans);
    return 0;
}

